app/controllers/admin/gigs_controller.rb

INSERT INTO "gigs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New Gig"], ["description", "test gig gig"], ["user_id", 1], ["created_at", "2019-04-17 18:37:43.118067"], ["updated_at", "2019-04-17 18:37:43.118067"]]
---
  def create
    @gig = current_user.gigs.create(gig_params)

SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @gig = Gig.find(params[:id])