app/controllers/admin/notes_controller.rb

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def new
    @site = Site.find(params[:site_id])

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "notes" ("body", "site_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "asdfasdfasdfasdfasdfasdfasdfasdfasdfasdfasdfasdfsa"], ["site_id", 1], ["created_at", "2019-04-21 13:08:50.969077"], ["updated_at", "2019-04-21 13:08:50.969077"]]
---
  def create
    @site = Site.find(params[:site_id])
    @note = @site.notes.create(note_params)