app/controllers/admin/sites_controller.rb

  def new
    @gig = Gig.find(params[:gig_id])
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @gig = Gig.find(params[:gig_id])
    @site = @gig.sites.create(site_params)
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sites" ("name", "street", "city", "state", "zipcode", "gig_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"