app/controllers/gigs_controller.rb

  def index
      @gigs = current_user.gigs.all
---
SELECT "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1  [["user_id", 2]]

  def show
      @gig = current_user.gigs.find(params[:id])
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1 AND "gigs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 8], ["LIMIT", 1]]

  def create
    @gig = current_user.gigs.create(gig_params)
---
INSERT INTO "gigs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Gig 3"], ["description", "asdfa"], ["user_id", 1], ["created_at", "2019-04-26 22:45:28.173887"], ["updated_at", "2019-04-26 22:45:28.173887"]]

  def edit
    @gig = current_user.gigs.find(params[:id])
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1 AND "gigs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 14], ["LIMIT", 1]]

  def update
    @gig = current_user.gigs.find(params[:id])

    respond_to do |format|
      if @gig.update(gig_params)
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1 AND "gigs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 14], ["LIMIT", 1]]
UPDATE "gigs" SET "title" = $1, "updated_at" = $2 WHERE "gigs"."id" = $3  [["title", "New Gig 1_update"], ["updated_at", "2019-06-17 22:56:17.537544"], ["id", 14]]

  def destroy
    @gig = current_user.gigs.find(params[:id])
    @sites = Site.where(:gig_id => params[:id]).destroy_all
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1 AND "gigs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 12], ["LIMIT", 1]]
DELETE FROM "sites" WHERE "sites"."id" = $1  [["id", 13]]
SELECT "sites".* FROM "sites" WHERE "sites"."gig_id" = $1  [["gig_id", 13]]
DELETE FROM "gigs" WHERE "gigs"."id" = $1  [["id", 13]]