app/controllers/gigs_controller.rb

DELETE FROM "gigs" WHERE "gigs"."id" = $1  [["id", 1]]
---
  def destroy
    @gig = Gig.find(params[:id])
    @gig.destroy