app/controllers/notes_controller.rb

  def new
    @site = Site.find(params[:site_id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def show
    @site = Site.find(params[:site_id])
    @note = @site.notes.find(params[:id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."site_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["site_id", 17], ["id", 56], ["LIMIT", 1]]

  def create
    @site = Site.find(params[:site_id])

    @note = current_site.notes.create(note_params)

    respond_to do |format|
      if @note.save
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "notes" ("body", "site_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "1234567891011"], ["site_id", 9], ["created_at", "2019-06-03 20:48:36.618468"], ["updated_at", "2019-06-03 20:48:36.618468"]]
UPDATE "notes" SET "image" = 'image/upload/v1556290509/rbtmuiqira234lajeabz.jpg' WHERE "notes"."id" = $1  [["id", 33]]

  def edit
    @site = Site.find(params[:site_id])
    @note = @site.notes.find(params[:id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."site_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["site_id", 17], ["id", 56], ["LIMIT", 1]]

  def update
    @gig = Site.find(params[:site_id]).gig_id
    @site = Site.find(params[:site_id])
    @note = @site.notes.find(params[:id])

    respond_to do |format|
      if @note.update(note_params)
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."site_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["site_id", 17], ["id", 56], ["LIMIT", 1]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "notes" SET "image" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["image", "mrttnigyldb2xhjocmuf.jpg"], ["updated_at", "2019-06-21 01:11:15.964057"], ["id", 56]]