app/controllers/sites_controller.rb

  def new
    @gig = current_user.gigs.find(params[:gig_id])
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1 AND "gigs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 8], ["LIMIT", 1]]

  def create
    @gig = current_user.gigs.find(params[:gig_id])
    @site = @gig.sites.create(site_params)
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1 AND "gigs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 8], ["LIMIT", 1]]
INSERT INTO "sites" ("name", "street", "city", "state", "zipcode", "gig_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def show
    @gig = current_user.gigs.find(params[:gig_id])
    @site = @gig.sites.find(params[:id])
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1 AND "gigs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 8], ["LIMIT", 1]]
SELECT  "sites".* FROM "sites" WHERE "sites"."gig_id" = $1 AND "sites"."id" = $2 LIMIT $3  [["gig_id", 8], ["id", 8], ["LIMIT", 1]]

  def destroy
    @gig = current_user.gigs.find(params[:gig_id])
    @site = @gig.sites.find(params[:id])
    @site.destroy
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1 AND "gigs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 13], ["LIMIT", 1]]
SELECT  "sites".* FROM "sites" WHERE "sites"."gig_id" = $1 AND "sites"."id" = $2 LIMIT $3  [["gig_id", 13], ["id", 12], ["LIMIT", 1]]
DELETE FROM "sites" WHERE "sites"."id" = $1  [["id", 12]]

  def edit
    @gig = current_user.gigs.find(params[:gig_id])
    @site = @gig.sites.find(params[:id])
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1 AND "gigs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 14], ["LIMIT", 1]]
SELECT  "sites".* FROM "sites" WHERE "sites"."gig_id" = $1 AND "sites"."id" = $2 LIMIT $3  [["gig_id", 14], ["id", 17], ["LIMIT", 1]]

  def update
    @gig = current_user.gigs.find(params[:gig_id])
    @site = @gig.sites.find(params[:id])

    respond_to do |format|
      if @site.update(site_params)
---
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."user_id" = $1 AND "gigs"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 14], ["LIMIT", 1]]
SELECT  "sites".* FROM "sites" WHERE "sites"."gig_id" = $1 AND "sites"."id" = $2 LIMIT $3  [["gig_id", 14], ["id", 17], ["LIMIT", 1]]
UPDATE "sites" SET "name" = $1, "updated_at" = $2 WHERE "sites"."id" = $3  [["name", "Venue Site 2"], ["updated_at", "2019-06-20 18:45:25.037868"], ["id", 17]]