app/views/admin/gigs/show.html.erb

    <ul>
      <% @gig.sites.each do |site| %>
---
SELECT "sites".* FROM "sites" WHERE "sites"."gig_id" = $1  [["gig_id", 6]]

        <ul>
          <% site.notes.each do |note| %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."site_id" = $1  [["site_id", 1]]