app/views/gigs/show.html.erb

<ul>
  <% @gig.sites.each do |site| %>
---
SELECT "sites".* FROM "sites" WHERE "sites"."gig_id" = $1  [["gig_id", 1]]