app/views/sites/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."site_id" = $1  [["site_id", 17]]
---
<div class="row">
  <% @site.notes.each do |note| %>